In [1]:
import pandas as pd

In [2]:
friends = [ {'age': 15, 'job': 'student'},
        {'age': 25, 'job': 'developer'},
        {'age': 30, 'job': 'teacher'}]

df = pd.DataFrame(friends,
                  index = ['john', 'jenny', 'Nate'],
                  columns = ['age', 'job'])
df

       age        job
john    15    student
jenny   25  developer
Nate    30    teacher

인덱스를 이용해 데이터 프레임 행,열 삭제

In [3]:
df.drop(['john', 'jenny'])

      age      job
Nate   30  teacher

In [4]:
friends = [ {'name': 'John', 'age': 15, 'job': 'student'},
        {'name': 'Ben','age': 25, 'job': 'developer'},
        {'name': 'Jenny','age': 30, 'job': 'teacher'}]

df = pd.DataFrame(friends,
                  columns = ['name','age', 'job'])

In [5]:
df

    name  age        job
0   John   15    student
1    Ben   25  developer
2  Jenny   30    teacher

In [6]:
df.drop([0,2])

  name  age        job
1  Ben   25  developer

In [7]:
df.drop('age', axis=1)
# axis = 0,열
# axis = 1,행

    name        job
0   John    student
1    Ben  developer
2  Jenny    teacher